src/DataProcessors/ДополнительныеРаботы/ДополнительныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДополнительныеРаботы</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выходные</name>
    <attributes>
      <name>Выходной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выходной1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной4</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной5</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной6</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной7</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной8</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной9</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной10</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной11</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной12</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной13</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной14</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной15</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной16</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной17</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной18</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной19</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной20</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной21</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной22</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной23</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной24</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной25</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной26</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной27</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной28</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной29</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной30</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной31</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ДополнительныеРаботы/ДополнительныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеРаботы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выходной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТехОперации/ТехОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехОперации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Технологическая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ДополнительныеРаботы/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда
	ПоследнийДеньМесяца = День(Объект.Период.ДатаОкончания);
		Если ПоследнийДеньМесяца = 28 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Ложь;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Ложь;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Ложь;
		Элементы.ВыходныеВыходной29.Видимость = Ложь;
		Элементы.ВыходныеВыходной30.Видимость = Ложь;
		Элементы.ВыходныеВыходной31.Видимость = Ложь;
		ИначеЕсли ПоследнийДеньМесяца = 29 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Ложь;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Ложь;
		Элементы.ВыходныеВыходной29.Видимость = Истина;
		Элементы.ВыходныеВыходной30.Видимость = Ложь;
		Элементы.ВыходныеВыходной31.Видимость = Ложь;
		ИначеЕсли ПоследнийДеньМесяца = 30 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Ложь;
		Элементы.ВыходныеВыходной29.Видимость = Истина;
		Элементы.ВыходныеВыходной30.Видимость = Истина;
		Элементы.ВыходныеВыходной31.Видимость = Ложь;
		ИначеЕсли ПоследнийДеньМесяца = 31 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Истина;
		Элементы.ВыходныеВыходной29.Видимость = Истина;
		Элементы.ВыходныеВыходной30.Видимость = Истина;
		Элементы.ВыходныеВыходной31.Видимость = Истина;	
		КонецЕсли;
	ОбновитьТаблицу();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.Период.ДатаНачала = Результат;
	Объект.Период.ДатаОкончания = КонецМесяца(Результат);
	ПоследнийДеньМесяца = День(Объект.Период.ДатаОкончания);
		Если ПоследнийДеньМесяца = 28 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Ложь;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Ложь;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Ложь;
		ИначеЕсли ПоследнийДеньМесяца = 29 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Ложь;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Ложь;
		ИначеЕсли ПоследнийДеньМесяца = 30 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Ложь;
		ИначеЕсли ПоследнийДеньМесяца = 31 Тогда	
		Элементы.ТабличнаяЧастьКоличество29.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество30.Видимость = Истина;
		Элементы.ТабличнаяЧастьКоличество31.Видимость = Истина;	
		КонецЕсли;
	ОбновитьТаблицу();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицу()
Объект.ТабличнаяЧасть.Очистить();
Объект.Выходные.Очистить();
ТЧ = Объект.Выходные.Добавить();
ТЧ.Выходной = "Выходной";
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала)и(Не Подразделение.Пустая())и(Не Сотрудник.Пустая()) Тогда
	ПоказатьТОНаСервере();
	ПоказатьИтогиНаСервере();
		Если РольДоступна("Администратор")или 
			РольДоступна("Мастер")или 
			РольДоступна("МастерУД")или 
			РольДоступна("Зарплата") Тогда	
		Элементы.ТабличнаяЧасть.ТолькоПросмотр = Ложь;
		Иначе
		Элементы.ТабличнаяЧасть.ТолькоПросмотр = Истина;
		КонецЕсли; 
	Иначе
	Элементы.ТабличнаяЧасть.ТолькоПросмотр = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПоказатьТОНаСервере()
ТЗ = Новый ТаблицаЗначений;
ТЗ_В = Новый ТаблицаЗначений;

Объект.ТабличнаяЧасть.Очистить();
ТЗ = Объект.ТабличнаяЧасть.Выгрузить();
ТЗ_В = Объект.Выходные.Выгрузить();
ТЧ_В = ТЗ_В[0];
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРаботы.Период КАК Период,
	|	ДополнительныеРаботы.ТехОперация КАК ТехОперация,
	|	ДополнительныеРаботы.Количество КАК Количество,
	|	ДополнительныеРаботы.Выходной КАК Выходной
	|ИЗ
	|	РегистрСведений.ДополнительныеРаботы КАК ДополнительныеРаботы
	|ГДЕ
	|	ДополнительныеРаботы.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ДополнительныеРаботы.Подразделение = &Подразделение
	|	И ДополнительныеРаботы.Сотрудник = &Сотрудник";
Запрос.УстановитьПараметр("ДатаНач", Объект.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Объект.Период.ДатаОкончания);
Запрос.УстановитьПараметр("Подразделение", Подразделение);
Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ВыбДень = День(ВыборкаДетальныеЗаписи.Период);
	Выборка = ТЗ.НайтиСтроки(Новый Структура("ТехОперация",ВыборкаДетальныеЗаписи.ТехОперация));
		Если Выборка.Количество() > 0 Тогда
		ТЧ = Выборка[0];		
		Иначе
		ТЧ = ТЗ.Добавить();
		ТЧ.ТехОперация = ВыборкаДетальныеЗаписи.ТехОперация;
		КонецЕсли;
	ТЧ[ВыбДень+1] = ВыборкаДетальныеЗаписи.Количество;
	ТЧ_В[ВыбДень+1] = ВыборкаДетальныеЗаписи.Выходной;
	КонецЦикла;
Объект.ТабличнаяЧасть.Загрузить(ТЗ); 
Объект.Выходные.Загрузить(ТЗ_В); 			
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
ТабличнаяЧастьПриИзмененииНаСервере();
ПоказатьИтогиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьПриИзмененииНаСервере()
ТЗ = Новый ТаблицаЗначений;
ТЗ_В = Новый ТаблицаЗначений;

ТЗ = Объект.ТабличнаяЧасть.Выгрузить();
ТЗ_В = Объект.Выходные.Выгрузить();
ТЧ_В = ТЗ_В[0];
	Попытка
		Для каждого ТЧ Из ТЗ Цикл
			Если Не ТЧ.ТехОперация.Пустая() Тогда
			ТекДата = Объект.Период.ДатаНачала;
			к = 2;
				Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
				Количество = ТЧ[к];
					Если Количество > 0 Тогда
					ДопРаботы = РегистрыСведений.ДополнительныеРаботы.СоздатьМенеджерЗаписи();
					ДопРаботы.Период = ТекДата;
					ДопРаботы.Подразделение = Подразделение; 
					ДопРаботы.Сотрудник = Сотрудник; 
					ДопРаботы.ТехОперация = ТЧ.ТехОперация;
					ДопРаботы.Количество = Количество;
					ДопРаботы.Выходной = ТЧ_В[к];
					ДопРаботы.Записать(Истина); 
					Иначе	
					НаборЗаписей = РегистрыСведений.ДополнительныеРаботы.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Период.Установить(ТекДата);
					НаборЗаписей.Отбор.Подразделение.Установить(Подразделение);
					НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
					НаборЗаписей.Отбор.ТехОперация.Установить(ТЧ.ТехОперация);
					НаборЗаписей.Записать(Истина);
					КонецЕсли;
				ТекДата = ТекДата + 86400;
				к = к + 1;
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла; 
	Исключение
	Сообщить(ОписаниеОшибки());			
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция УдалитьДанныеПоСтроке(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ТекДата = Объект.Период.ДатаНачала;
		Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		НаборЗаписей = РегистрыСведений.ДополнительныеРаботы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ТекДата);
		НаборЗаписей.Отбор.Подразделение.Установить(Подразделение);
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
		НаборЗаписей.Отбор.ТехОперация.Установить(ТЧ.ТехОперация);
		НаборЗаписей.Записать(Истина);			
		ТекДата = ТекДата + 86400;
		КонецЦикла; 	
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецПопытки;
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧастьПередУдалением(Элемент, Отказ)
	Если Вопрос("Вы уверены, что хотите удалить данные по строке?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Если Не УдалитьДанныеПоСтроке(Элементы.ТабличнаяЧасть.ТекущаяСтрока) Тогда
		Отказ = Истина;
		КонецЕсли;
	Иначе
	Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПослеУдаления(Элемент)
ПоказатьИтогиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
ОбновитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
ОбновитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ДобавитьТОПоГруппеНаСервере(ГруппаТО)
Выборка = Справочники.ТехОперации.Выбрать(ГруппаТО);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
		Продолжить;		
		КонецЕсли; 
			Если Выборка.ЭтоГруппа Тогда
			Продолжить;		
			КонецЕсли;
	ВыборкаТЧ = Объект.ТабличнаяЧасть.НайтиСтроки(Новый Структура("ТехОперация",Выборка.Ссылка));
		Если ВыборкаТЧ.Количество() = 0 Тогда
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ.ТехОперация = Выборка.Ссылка;
		КонецЕсли;		
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТОПоГруппе(Команда)
ГруппаТО = Неопределено;
Результат = ОткрытьФормуМодально("Справочник.ТехОперации.ФормаВыбораГруппы");
	Если Результат <> Неопределено Тогда	
	ДобавитьТОПоГруппеНаСервере(Результат); 	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПоказатьИтогиНаСервере()
ТЗ = Новый ТаблицаЗначений;

ТЗ = Объект.ТабличнаяЧасть.Выгрузить();
ТабДок.Очистить();
Макет = Обработки.ДополнительныеРаботы.ПолучитьМакет("Макет"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");
ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Подразделение = Подразделение;
ОблШапка.Параметры.Сотрудник = Сотрудник;
ТабДок.Вывести(ОблШапка);
ВсегоДР = 0;
ВсегоОД = 0;
	Для каждого ТЧ Из ТЗ Цикл
	ТекДата = Объект.Период.ДатаНачала;
	к = 2;
	Количество = 0;
		Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Количество = Количество + ТЧ[к];
		ТекДата = ТекДата + 86400;
		к = к + 1;
		КонецЦикла;
	ОблСтрока.Параметры.ТехОперация = ТЧ.ТехОперация;
	ОблСтрока.Параметры.Количество = Количество;
	НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Объект.Период.ДатаОкончания,Новый Структура("ТехОперация",ТЧ.ТехОперация));
	ОблСтрока.Параметры.Расценка = НормыТО.Стоимость;
	ОблСтрока.Параметры.КР = Сотрудник.Должность.КоэффициентРазряда;
	Стоимость = ?(НормыТО.Норма > 0,Количество/НормыТО.Норма,0)*ОблСтрока.Параметры.Расценка*ОблСтрока.Параметры.КР;
		Если ТЧ.ТехОперация.ДополнительныеРаботы Тогда
		ОблСтрока.Параметры.ИтогоДР = Стоимость;
		ОблСтрока.Параметры.ИтогоОД = 0;
		ВсегоДР = ВсегоДР + ОблСтрока.Параметры.ИтогоДР;
		Иначе	
		ОблСтрока.Параметры.ИтогоОД = Стоимость;
		ОблСтрока.Параметры.ИтогоДР = 0;
		ВсегоОД = ВсегоОД + ОблСтрока.Параметры.ИтогоОД;
		КонецЕсли; 
	ТабДок.Вывести(ОблСтрока);	
	КонецЦикла;
ОблКонец.Параметры.ВсегоДР = ВсегоДР; 
ОблКонец.Параметры.ВсегоОД = ВсегоОД;
ТабДок.Вывести(ОблКонец);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ОбщийМодульВызовСервера.РазрешенноеПодразделение(ВыбранноеЗначение) Тогда
	Сообщить("У Вас нет прав для просмотра отчёта по выбранному подразделению!");
	СтандартнаяОбработка = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеПриИзменении(Элемент)
ТабличнаяЧастьПриИзмененииНаСервере();
ПоказатьИтогиНаСервере();
КонецПроцедуры
